; ModuleID = 'test1.bc'
source_filename = "test1.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { ptr, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", ptr, i8, i8, ptr, ptr, ptr, ptr }
%"class.std::ios_base" = type { ptr, i64, i64, i32, i32, i32, ptr, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, ptr, %"class.std::locale" }
%"struct.std::ios_base::_Words" = type { ptr, i64 }
%"class.std::locale" = type { ptr }

@_ZStL8__ioinit = internal global %"class.std::ios_base::Init" zeroinitializer, align 1, !dbg !0
@__dso_handle = external hidden global i8
@_ZSt4cout = external global %"class.std::basic_ostream", align 8
@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !7
@llvm.global_ctors = appending global [1 x { i32, ptr, ptr }] [{ i32, ptr, ptr } { i32 65535, ptr @_GLOBAL__sub_I_test1.cc, ptr null }]

declare void @_ZNSt8ios_base4InitC1Ev(ptr noundef nonnull align 1 dereferenceable(1)) unnamed_addr #0

; Function Attrs: nounwind
declare void @_ZNSt8ios_base4InitD1Ev(ptr noundef nonnull align 1 dereferenceable(1)) unnamed_addr #1

; Function Attrs: nofree nounwind
declare i32 @__cxa_atexit(ptr, ptr, ptr) local_unnamed_addr #2


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !2, file: !3, line: 74, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "std", scope: null)
!3 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/iostream", directory: "")
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 639, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h", directory: "")
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 233, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !9, line: 10, type: !10, isLocal: true, isDefinition: true)
!9 = !DIFile(filename: "test1.cc", directory: "/n/eecs583b/home/mrzaidi/research_project/TFA-project-583", checksumkind: CSK_MD5, checksum: "61c3a49b8745a49b7cd6713bdf31aed4")
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 16, elements: !13)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14}
!14 = !DISubrange(count: 2)
!15 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !9, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !16, retainedTypes: !27, globals: !33, imports: !34, splitDebugInlining: false, nameTableKind: None)
!16 = !{!17}
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !2, file: !5, line: 154, baseType: !18, size: 32, elements: !19, identifier: "_ZTSSt12_Ios_Iostate")
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !{!20, !21, !22, !23, !24, !25, !26}
!20 = !DIEnumerator(name: "_S_goodbit", value: 0)
!21 = !DIEnumerator(name: "_S_badbit", value: 1)
!22 = !DIEnumerator(name: "_S_eofbit", value: 2)
!23 = !DIEnumerator(name: "_S_failbit", value: 4)
!24 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
!25 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
!26 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
!27 = !{!28, !17, !18, !6}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !2, file: !29, line: 68, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/postypes.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !2, file: !31, line: 299, baseType: !32)
!31 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h", directory: "", checksumkind: CSK_MD5, checksum: "1035510fa573a2a294e7e4fd7d234766")
!32 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!33 = !{!0, !7}
!34 = !{!35, !53, !56, !61, !125, !133, !137, !144, !148, !152, !154, !156, !160, !168, !172, !178, !184, !186, !190, !194, !198, !202, !213, !215, !219, !223, !227, !229, !234, !238, !242, !244, !246, !250, !258, !262, !266, !270, !272, !278, !280, !287, !292, !296, !300, !304, !308, !312, !314, !316, !320, !324, !328, !330, !334, !338, !340, !342, !346, !352, !357, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !376, !380, !385, !389, !392, !395, !398, !400, !402, !404, !407, !410, !413, !416, !419, !421, !426, !429, !432, !435, !437, !439, !441, !443, !446, !449, !452, !455, !458, !460, !464, !468, !473, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !509, !513, !517, !523, !527, !531, !536, !538, !543, !547, !551, !562, !564, !568, !572, !576, !580, !584, !588, !592, !596, !600, !604, !608, !610, !614, !618, !622, !628, !632, !636, !638, !642, !646, !652, !654, !658, !662, !666, !670, !674, !678, !682, !683, !684, !685, !687, !688, !689, !690, !691, !692, !693, !697, !703, !708, !712, !714, !716, !718, !720, !727, !731, !735, !739, !743, !747, !752, !756, !758, !762, !768, !772, !777, !779, !782, !786, !790, !792, !794, !796, !798, !802, !804, !806, !810, !814, !818, !822, !826, !830, !832, !836, !840, !844, !848, !850, !852, !856, !860, !861, !862, !863, !864, !865, !871, !874, !875, !877, !879, !881, !883, !887, !889, !891, !893, !895, !897, !899, !901, !903, !907, !911, !913, !917}
!35 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !36, file: !52, line: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !37, line: 6, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !39, line: 21, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !41, identifier: "_ZTS11__mbstate_t")
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !40, file: !39, line: 15, baseType: !18, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !40, file: !39, line: 20, baseType: !44, size: 32, offset: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !40, file: !39, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !45, identifier: "_ZTSN11__mbstate_tUt_E")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !44, file: !39, line: 18, baseType: !47, size: 32)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !44, file: !39, line: 19, baseType: !49, size: 32)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/cwchar", directory: "")
!53 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !54, file: !52, line: 141)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !55, line: 20, baseType: !47)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!56 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !57, file: !52, line: 143)
!57 = !DISubprogram(name: "btowc", scope: !58, file: !58, line: 319, type: !59, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!58 = !DIFile(filename: "/usr/include/wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "484b7adbbc849bb51cdbcb2d985b07a0")
!59 = !DISubroutineType(types: !60)
!60 = !{!54, !18}
!61 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !62, file: !52, line: 144)
!62 = !DISubprogram(name: "fgetwc", scope: !58, file: !58, line: 744, type: !63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!63 = !DISubroutineType(types: !64)
!64 = !{!54, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !67, line: 5, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "72a8fe90981f484acae7c6f3dfc5c2b7")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !70, identifier: "_ZTS8_IO_FILE")
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !94, !96, !98, !102, !105, !107, !110, !113, !114, !116, !120, !121}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 51, baseType: !18, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 54, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 55, baseType: !73, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 56, baseType: !73, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 57, baseType: !73, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 58, baseType: !73, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 59, baseType: !73, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 60, baseType: !73, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 61, baseType: !73, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 64, baseType: !73, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 65, baseType: !73, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 66, baseType: !73, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 72, baseType: !18, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 73, baseType: !18, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !32)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 77, baseType: !95, size: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 153, baseType: !32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !68, file: !69, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !69, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !68, file: !69, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !69, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !68, file: !69, line: 93, baseType: !88, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !68, file: !69, line: 94, baseType: !115, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 95, baseType: !117, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 18, baseType: !119)
!118 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!119 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 96, baseType: !18, size: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 98, baseType: !122, size: 160, offset: 1568)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 20)
!125 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !126, file: !52, line: 145)
!126 = !DISubprogram(name: "fgetws", scope: !58, file: !58, line: 773, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !131, !18, !132}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !129)
!132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!133 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !134, file: !52, line: 146)
!134 = !DISubprogram(name: "fputwc", scope: !58, file: !58, line: 758, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!54, !130, !65}
!137 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !138, file: !52, line: 147)
!138 = !DISubprogram(name: "fputws", scope: !58, file: !58, line: 780, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{!18, !141, !132}
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !145, file: !52, line: 148)
!145 = !DISubprogram(name: "fwide", scope: !58, file: !58, line: 588, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!146 = !DISubroutineType(types: !147)
!147 = !{!18, !65, !18}
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !149, file: !52, line: 149)
!149 = !DISubprogram(name: "fwprintf", scope: !58, file: !58, line: 595, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!150 = !DISubroutineType(types: !151)
!151 = !{!18, !132, !141, null}
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !153, file: !52, line: 150)
!153 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !58, file: !58, line: 657, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !155, file: !52, line: 151)
!155 = !DISubprogram(name: "getwc", scope: !58, file: !58, line: 745, type: !63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !157, file: !52, line: 152)
!157 = !DISubprogram(name: "getwchar", scope: !58, file: !58, line: 751, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!54}
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !161, file: !52, line: 153)
!161 = !DISubprogram(name: "mbrlen", scope: !58, file: !58, line: 330, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubroutineType(types: !163)
!163 = !{!117, !164, !117, !166}
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !169, file: !52, line: 154)
!169 = !DISubprogram(name: "mbrtowc", scope: !58, file: !58, line: 297, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{!117, !131, !164, !117, !166}
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !173, file: !52, line: 155)
!173 = !DISubprogram(name: "mbsinit", scope: !58, file: !58, line: 293, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!18, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !179, file: !52, line: 156)
!179 = !DISubprogram(name: "mbsrtowcs", scope: !58, file: !58, line: 338, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!117, !131, !182, !117, !166}
!182 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !185, file: !52, line: 157)
!185 = !DISubprogram(name: "putwc", scope: !58, file: !58, line: 759, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !187, file: !52, line: 158)
!187 = !DISubprogram(name: "putwchar", scope: !58, file: !58, line: 765, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{!54, !130}
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !191, file: !52, line: 160)
!191 = !DISubprogram(name: "swprintf", scope: !58, file: !58, line: 605, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!18, !131, !117, !141, null}
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !195, file: !52, line: 162)
!195 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !58, file: !58, line: 664, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!18, !141, !141, null}
!198 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !199, file: !52, line: 163)
!199 = !DISubprogram(name: "ungetwc", scope: !58, file: !58, line: 788, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!54, !54, !65}
!202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !203, file: !52, line: 164)
!203 = !DISubprogram(name: "vfwprintf", scope: !58, file: !58, line: 613, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!204 = !DISubroutineType(types: !205)
!205 = !{!18, !132, !141, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !208, identifier: "_ZTS13__va_list_tag")
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !207, file: !9, baseType: !47, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !207, file: !9, baseType: !47, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !207, file: !9, baseType: !115, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !207, file: !9, baseType: !115, size: 64, offset: 128)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !214, file: !52, line: 166)
!214 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !58, file: !58, line: 711, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !216, file: !52, line: 169)
!216 = !DISubprogram(name: "vswprintf", scope: !58, file: !58, line: 626, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{!18, !131, !117, !141, !206}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !220, file: !52, line: 172)
!220 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !58, file: !58, line: 718, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{!18, !141, !141, !206}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !224, file: !52, line: 174)
!224 = !DISubprogram(name: "vwprintf", scope: !58, file: !58, line: 621, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{!18, !141, !206}
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !228, file: !52, line: 176)
!228 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !58, file: !58, line: 715, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !230, file: !52, line: 178)
!230 = !DISubprogram(name: "wcrtomb", scope: !58, file: !58, line: 302, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DISubroutineType(types: !232)
!232 = !{!117, !233, !130, !166}
!233 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !235, file: !52, line: 179)
!235 = !DISubprogram(name: "wcscat", scope: !58, file: !58, line: 97, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!129, !131, !141}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !239, file: !52, line: 180)
!239 = !DISubprogram(name: "wcscmp", scope: !58, file: !58, line: 106, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubroutineType(types: !241)
!241 = !{!18, !142, !142}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !243, file: !52, line: 181)
!243 = !DISubprogram(name: "wcscoll", scope: !58, file: !58, line: 131, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !245, file: !52, line: 182)
!245 = !DISubprogram(name: "wcscpy", scope: !58, file: !58, line: 87, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !247, file: !52, line: 183)
!247 = !DISubprogram(name: "wcscspn", scope: !58, file: !58, line: 188, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubroutineType(types: !249)
!249 = !{!117, !142, !142}
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !251, file: !52, line: 184)
!251 = !DISubprogram(name: "wcsftime", scope: !58, file: !58, line: 852, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!252 = !DISubroutineType(types: !253)
!253 = !{!117, !131, !117, !141, !254}
!254 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !58, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !259, file: !52, line: 185)
!259 = !DISubprogram(name: "wcslen", scope: !58, file: !58, line: 223, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{!117, !142}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !263, file: !52, line: 186)
!263 = !DISubprogram(name: "wcsncat", scope: !58, file: !58, line: 101, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!129, !131, !141, !117}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !267, file: !52, line: 187)
!267 = !DISubprogram(name: "wcsncmp", scope: !58, file: !58, line: 109, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{!18, !142, !142, !117}
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !271, file: !52, line: 188)
!271 = !DISubprogram(name: "wcsncpy", scope: !58, file: !58, line: 92, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !273, file: !52, line: 189)
!273 = !DISubprogram(name: "wcsrtombs", scope: !58, file: !58, line: 344, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{!117, !233, !276, !117, !166}
!276 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !279, file: !52, line: 190)
!279 = !DISubprogram(name: "wcsspn", scope: !58, file: !58, line: 192, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !281, file: !52, line: 191)
!281 = !DISubprogram(name: "wcstod", scope: !58, file: !58, line: 378, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !141, !285}
!284 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !288, file: !52, line: 193)
!288 = !DISubprogram(name: "wcstof", scope: !58, file: !58, line: 383, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !141, !285}
!291 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !293, file: !52, line: 195)
!293 = !DISubprogram(name: "wcstok", scope: !58, file: !58, line: 218, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!129, !131, !141, !285}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !297, file: !52, line: 196)
!297 = !DISubprogram(name: "wcstol", scope: !58, file: !58, line: 429, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!32, !141, !285, !18}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !301, file: !52, line: 197)
!301 = !DISubprogram(name: "wcstoul", scope: !58, file: !58, line: 434, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!119, !141, !285, !18}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !305, file: !52, line: 198)
!305 = !DISubprogram(name: "wcsxfrm", scope: !58, file: !58, line: 135, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!117, !131, !141, !117}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !309, file: !52, line: 199)
!309 = !DISubprogram(name: "wctob", scope: !58, file: !58, line: 325, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!18, !54}
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !313, file: !52, line: 200)
!313 = !DISubprogram(name: "wmemcmp", scope: !58, file: !58, line: 259, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !315, file: !52, line: 201)
!315 = !DISubprogram(name: "wmemcpy", scope: !58, file: !58, line: 263, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !317, file: !52, line: 202)
!317 = !DISubprogram(name: "wmemmove", scope: !58, file: !58, line: 268, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!129, !129, !142, !117}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !321, file: !52, line: 203)
!321 = !DISubprogram(name: "wmemset", scope: !58, file: !58, line: 272, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!129, !129, !130, !117}
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !52, line: 204)
!325 = !DISubprogram(name: "wprintf", scope: !58, file: !58, line: 602, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!18, !141, null}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !52, line: 205)
!329 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !58, file: !58, line: 661, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !331, file: !52, line: 206)
!331 = !DISubprogram(name: "wcschr", scope: !58, file: !58, line: 165, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DISubroutineType(types: !333)
!333 = !{!129, !142, !130}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !335, file: !52, line: 207)
!335 = !DISubprogram(name: "wcspbrk", scope: !58, file: !58, line: 202, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!129, !142, !142}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !339, file: !52, line: 208)
!339 = !DISubprogram(name: "wcsrchr", scope: !58, file: !58, line: 175, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !341, file: !52, line: 209)
!341 = !DISubprogram(name: "wcsstr", scope: !58, file: !58, line: 213, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !343, file: !52, line: 210)
!343 = !DISubprogram(name: "wmemchr", scope: !58, file: !58, line: 254, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubroutineType(types: !345)
!345 = !{!129, !142, !130, !117}
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !348, file: !52, line: 251)
!347 = !DINamespace(name: "__gnu_cxx", scope: null)
!348 = !DISubprogram(name: "wcstold", scope: !58, file: !58, line: 385, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !141, !285}
!351 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !353, file: !52, line: 260)
!353 = !DISubprogram(name: "wcstoll", scope: !58, file: !58, line: 442, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{!356, !141, !285, !18}
!356 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !358, file: !52, line: 261)
!358 = !DISubprogram(name: "wcstoull", scope: !58, file: !58, line: 449, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !141, !285, !18}
!361 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !348, file: !52, line: 267)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !353, file: !52, line: 268)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !358, file: !52, line: 269)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !288, file: !52, line: 283)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !214, file: !52, line: 286)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !220, file: !52, line: 289)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !228, file: !52, line: 292)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !348, file: !52, line: 296)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !353, file: !52, line: 297)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !358, file: !52, line: 298)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !373, file: !374, line: 68)
!373 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !375, file: !374, line: 90, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!374 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "e8a32dcadc5d06d341e371fb480b7b44")
!375 = !DINamespace(name: "__exception_ptr", scope: !2)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !375, entity: !377, file: !374, line: 84)
!377 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !374, line: 80, type: !378, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !373}
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !381, file: !384, line: 47)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !382, line: 24, baseType: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !93, line: 37, baseType: !97)
!384 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/cstdint", directory: "")
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !386, file: !384, line: 48)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !382, line: 25, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !93, line: 39, baseType: !388)
!388 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !390, file: !384, line: 49)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !382, line: 26, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !93, line: 41, baseType: !18)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !393, file: !384, line: 50)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !382, line: 27, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !93, line: 44, baseType: !32)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !396, file: !384, line: 52)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !397, line: 58, baseType: !97)
!397 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !399, file: !384, line: 53)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !397, line: 60, baseType: !32)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !401, file: !384, line: 54)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !397, line: 61, baseType: !32)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !403, file: !384, line: 55)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !397, line: 62, baseType: !32)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !405, file: !384, line: 57)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !397, line: 43, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !93, line: 52, baseType: !383)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !408, file: !384, line: 58)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !397, line: 44, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !93, line: 54, baseType: !387)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !384, line: 59)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !397, line: 45, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !93, line: 56, baseType: !391)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !414, file: !384, line: 60)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !397, line: 46, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !93, line: 58, baseType: !394)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !384, line: 62)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !397, line: 101, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !93, line: 72, baseType: !32)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !420, file: !384, line: 63)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !397, line: 87, baseType: !32)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !422, file: !384, line: 65)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !423, line: 24, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !93, line: 38, baseType: !425)
!425 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !427, file: !384, line: 66)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !423, line: 25, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !93, line: 40, baseType: !95)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !430, file: !384, line: 67)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !423, line: 26, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !93, line: 42, baseType: !47)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !433, file: !384, line: 68)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !423, line: 27, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !93, line: 45, baseType: !119)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !436, file: !384, line: 70)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !397, line: 71, baseType: !425)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !438, file: !384, line: 71)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !397, line: 73, baseType: !119)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !440, file: !384, line: 72)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !397, line: 74, baseType: !119)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !442, file: !384, line: 73)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !397, line: 75, baseType: !119)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !444, file: !384, line: 75)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !397, line: 49, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !93, line: 53, baseType: !424)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !447, file: !384, line: 76)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !397, line: 50, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !93, line: 55, baseType: !428)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !450, file: !384, line: 77)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !397, line: 51, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !93, line: 57, baseType: !431)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !453, file: !384, line: 78)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !397, line: 52, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !93, line: 59, baseType: !434)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !456, file: !384, line: 80)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !397, line: 102, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !93, line: 73, baseType: !119)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !459, file: !384, line: 81)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !397, line: 90, baseType: !119)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !461, file: !463, line: 53)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !462, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!462 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!463 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/clocale", directory: "")
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !465, file: !463, line: 54)
!465 = !DISubprogram(name: "setlocale", scope: !462, file: !462, line: 122, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubroutineType(types: !467)
!467 = !{!73, !18, !165}
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !469, file: !463, line: 55)
!469 = !DISubprogram(name: "localeconv", scope: !462, file: !462, line: 125, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DISubroutineType(types: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !474, file: !478, line: 64)
!474 = !DISubprogram(name: "isalnum", scope: !475, file: !475, line: 108, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!476 = !DISubroutineType(types: !477)
!477 = !{!18, !18}
!478 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/cctype", directory: "")
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !480, file: !478, line: 65)
!480 = !DISubprogram(name: "isalpha", scope: !475, file: !475, line: 109, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !482, file: !478, line: 66)
!482 = !DISubprogram(name: "iscntrl", scope: !475, file: !475, line: 110, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !484, file: !478, line: 67)
!484 = !DISubprogram(name: "isdigit", scope: !475, file: !475, line: 111, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !486, file: !478, line: 68)
!486 = !DISubprogram(name: "isgraph", scope: !475, file: !475, line: 113, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !488, file: !478, line: 69)
!488 = !DISubprogram(name: "islower", scope: !475, file: !475, line: 112, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !490, file: !478, line: 70)
!490 = !DISubprogram(name: "isprint", scope: !475, file: !475, line: 114, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !492, file: !478, line: 71)
!492 = !DISubprogram(name: "ispunct", scope: !475, file: !475, line: 115, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !494, file: !478, line: 72)
!494 = !DISubprogram(name: "isspace", scope: !475, file: !475, line: 116, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !496, file: !478, line: 73)
!496 = !DISubprogram(name: "isupper", scope: !475, file: !475, line: 117, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !498, file: !478, line: 74)
!498 = !DISubprogram(name: "isxdigit", scope: !475, file: !475, line: 118, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !500, file: !478, line: 75)
!500 = !DISubprogram(name: "tolower", scope: !475, file: !475, line: 122, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !502, file: !478, line: 76)
!502 = !DISubprogram(name: "toupper", scope: !475, file: !475, line: 125, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !504, file: !478, line: 87)
!504 = !DISubprogram(name: "isblank", scope: !475, file: !475, line: 130, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!505 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !506, entity: !507, file: !508, line: 58)
!506 = !DINamespace(name: "__gnu_debug", scope: null)
!507 = !DINamespace(name: "__debug", scope: !2)
!508 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/debug/debug.h", directory: "", checksumkind: CSK_MD5, checksum: "09fce61e0085ea92b4bd81d6cd4dcc16")
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !510, file: !512, line: 52)
!510 = !DISubprogram(name: "abs", scope: !511, file: !511, line: 848, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!511 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!512 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/std_abs.h", directory: "")
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !514, file: !516, line: 127)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !511, line: 63, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 59, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!516 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/cstdlib", directory: "")
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !518, file: !516, line: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !511, line: 71, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 67, size: 128, flags: DIFlagTypePassByValue, elements: !520, identifier: "_ZTS6ldiv_t")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !519, file: !511, line: 69, baseType: !32, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !519, file: !511, line: 70, baseType: !32, size: 64, offset: 64)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !524, file: !516, line: 130)
!524 = !DISubprogram(name: "abort", scope: !511, file: !511, line: 598, type: !525, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{null}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !528, file: !516, line: 132)
!528 = !DISubprogram(name: "aligned_alloc", scope: !511, file: !511, line: 592, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!529 = !DISubroutineType(types: !530)
!530 = !{!115, !117, !117}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !532, file: !516, line: 134)
!532 = !DISubprogram(name: "atexit", scope: !511, file: !511, line: 602, type: !533, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{!18, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !537, file: !516, line: 137)
!537 = !DISubprogram(name: "at_quick_exit", scope: !511, file: !511, line: 607, type: !533, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !539, file: !516, line: 140)
!539 = !DISubprogram(name: "atof", scope: !540, file: !540, line: 25, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "adfe1626ff4efc68ac58c367ff5f206b")
!541 = !DISubroutineType(types: !542)
!542 = !{!284, !165}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !544, file: !516, line: 141)
!544 = !DISubprogram(name: "atoi", scope: !511, file: !511, line: 362, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(types: !546)
!546 = !{!18, !165}
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !548, file: !516, line: 142)
!548 = !DISubprogram(name: "atol", scope: !511, file: !511, line: 367, type: !549, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{!32, !165}
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !552, file: !516, line: 143)
!552 = !DISubprogram(name: "bsearch", scope: !553, file: !553, line: 20, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "", checksumkind: CSK_MD5, checksum: "724ededa330cc3e0cbd34c5b4030a6f6")
!554 = !DISubroutineType(types: !555)
!555 = !{!115, !556, !556, !117, !117, !558}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !511, line: 816, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!18, !556, !556}
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !563, file: !516, line: 144)
!563 = !DISubprogram(name: "calloc", scope: !511, file: !511, line: 543, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !565, file: !516, line: 145)
!565 = !DISubprogram(name: "div", scope: !511, file: !511, line: 860, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!566 = !DISubroutineType(types: !567)
!567 = !{!514, !18, !18}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !569, file: !516, line: 146)
!569 = !DISubprogram(name: "exit", scope: !511, file: !511, line: 624, type: !570, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !18}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !573, file: !516, line: 147)
!573 = !DISubprogram(name: "free", scope: !511, file: !511, line: 555, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !115}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !577, file: !516, line: 148)
!577 = !DISubprogram(name: "getenv", scope: !511, file: !511, line: 641, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{!73, !165}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !581, file: !516, line: 149)
!581 = !DISubprogram(name: "labs", scope: !511, file: !511, line: 849, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!582 = !DISubroutineType(types: !583)
!583 = !{!32, !32}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !585, file: !516, line: 150)
!585 = !DISubprogram(name: "ldiv", scope: !511, file: !511, line: 862, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!586 = !DISubroutineType(types: !587)
!587 = !{!518, !32, !32}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !589, file: !516, line: 151)
!589 = !DISubprogram(name: "malloc", scope: !511, file: !511, line: 540, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubroutineType(types: !591)
!591 = !{!115, !117}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !593, file: !516, line: 153)
!593 = !DISubprogram(name: "mblen", scope: !511, file: !511, line: 930, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{!18, !165, !117}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !597, file: !516, line: 154)
!597 = !DISubprogram(name: "mbstowcs", scope: !511, file: !511, line: 941, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubroutineType(types: !599)
!599 = !{!117, !131, !164, !117}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !601, file: !516, line: 155)
!601 = !DISubprogram(name: "mbtowc", scope: !511, file: !511, line: 933, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!602 = !DISubroutineType(types: !603)
!603 = !{!18, !131, !164, !117}
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !605, file: !516, line: 157)
!605 = !DISubprogram(name: "qsort", scope: !511, file: !511, line: 838, type: !606, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !115, !117, !117, !558}
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !609, file: !516, line: 160)
!609 = !DISubprogram(name: "quick_exit", scope: !511, file: !511, line: 630, type: !570, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !611, file: !516, line: 163)
!611 = !DISubprogram(name: "rand", scope: !511, file: !511, line: 454, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{!18}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !615, file: !516, line: 164)
!615 = !DISubprogram(name: "realloc", scope: !511, file: !511, line: 551, type: !616, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!616 = !DISubroutineType(types: !617)
!617 = !{!115, !115, !117}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !619, file: !516, line: 165)
!619 = !DISubprogram(name: "srand", scope: !511, file: !511, line: 456, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !47}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !623, file: !516, line: 166)
!623 = !DISubprogram(name: "strtod", scope: !511, file: !511, line: 118, type: !624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DISubroutineType(types: !625)
!625 = !{!284, !164, !626}
!626 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !629, file: !516, line: 167)
!629 = !DISubprogram(name: "strtol", scope: !511, file: !511, line: 177, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubroutineType(types: !631)
!631 = !{!32, !164, !626, !18}
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !633, file: !516, line: 168)
!633 = !DISubprogram(name: "strtoul", scope: !511, file: !511, line: 181, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!634 = !DISubroutineType(types: !635)
!635 = !{!119, !164, !626, !18}
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !637, file: !516, line: 169)
!637 = !DISubprogram(name: "system", scope: !511, file: !511, line: 791, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !639, file: !516, line: 171)
!639 = !DISubprogram(name: "wcstombs", scope: !511, file: !511, line: 945, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!640 = !DISubroutineType(types: !641)
!641 = !{!117, !233, !141, !117}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !643, file: !516, line: 172)
!643 = !DISubprogram(name: "wctomb", scope: !511, file: !511, line: 937, type: !644, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!644 = !DISubroutineType(types: !645)
!645 = !{!18, !73, !130}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !647, file: !516, line: 200)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !511, line: 81, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 77, size: 128, flags: DIFlagTypePassByValue, elements: !649, identifier: "_ZTS7lldiv_t")
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !648, file: !511, line: 79, baseType: !356, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !648, file: !511, line: 80, baseType: !356, size: 64, offset: 64)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !653, file: !516, line: 206)
!653 = !DISubprogram(name: "_Exit", scope: !511, file: !511, line: 636, type: !570, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !655, file: !516, line: 210)
!655 = !DISubprogram(name: "llabs", scope: !511, file: !511, line: 852, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubroutineType(types: !657)
!657 = !{!356, !356}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !659, file: !516, line: 216)
!659 = !DISubprogram(name: "lldiv", scope: !511, file: !511, line: 866, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DISubroutineType(types: !661)
!661 = !{!647, !356, !356}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !663, file: !516, line: 227)
!663 = !DISubprogram(name: "atoll", scope: !511, file: !511, line: 374, type: !664, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!664 = !DISubroutineType(types: !665)
!665 = !{!356, !165}
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !667, file: !516, line: 228)
!667 = !DISubprogram(name: "strtoll", scope: !511, file: !511, line: 201, type: !668, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!668 = !DISubroutineType(types: !669)
!669 = !{!356, !164, !626, !18}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !671, file: !516, line: 229)
!671 = !DISubprogram(name: "strtoull", scope: !511, file: !511, line: 206, type: !672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!672 = !DISubroutineType(types: !673)
!673 = !{!361, !164, !626, !18}
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !675, file: !516, line: 231)
!675 = !DISubprogram(name: "strtof", scope: !511, file: !511, line: 124, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!676 = !DISubroutineType(types: !677)
!677 = !{!291, !164, !626}
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !679, file: !516, line: 232)
!679 = !DISubprogram(name: "strtold", scope: !511, file: !511, line: 127, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DISubroutineType(types: !681)
!681 = !{!351, !164, !626}
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !647, file: !516, line: 240)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !653, file: !516, line: 242)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !655, file: !516, line: 244)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !686, file: !516, line: 245)
!686 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !347, file: !516, line: 213, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !659, file: !516, line: 246)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !663, file: !516, line: 248)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !675, file: !516, line: 249)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !667, file: !516, line: 250)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !671, file: !516, line: 251)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !679, file: !516, line: 252)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !694, file: !696, line: 98)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !695, line: 7, baseType: !68)
